netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_getItemAvailability_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header/>
   <soapenv:Body>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:method>getItemAvailability</urn:method>
     <urn:warningAsError>true</urn:warningAsError>
    <urn:disableMandatoryCustomFieldValidation>false</urn:disableMandatoryCustomFieldValidation>
    <urn:disableSystemNotesForCustomFields>true</urn:disableSystemNotesForCustomFields>
    <urn:ignoreReadOnlyFields>true</urn:ignoreReadOnlyFields>
      <urn:partnerId/>
      <urn:applicationId/>
      <urn:email>%s(email)</urn:email>
      <urn:password>%s(password)</urn:password>
      <urn:account>%s(account)</urn:account>
      <urn:roleInternalId/>
      <urn:roleExternalId/>
      <urn:roleType/>
      <urn:roleName/>
	  <urn:itemAvailabilityFilter>
         <platformMsgs:itemAvailabilityFilter xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com"
					xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com">
            <platformCore:item>
               <platformCore:recordRef internalId="%s(getItemAvailabilityInventoryItemInternalId)"  type="inventoryItem">
               </platformCore:recordRef>
            </platformCore:item>
          <platformCore:lastQtyAvailableChange>%s(getItemAvailabilityLastQtyAvailableChange)</platformCore:lastQtyAvailableChange>
         </platformMsgs:itemAvailabilityFilter>
	  </urn:itemAvailabilityFilter>
   </soapenv:Body>
</soapenv:Envelope>



